Desafios/livro/app/controllers/books_controller.rb

INSERT INTO "books" ("tittle", "author", "score", "description", "created_at", "updated_at") VALUES ('v', 'v', 4.0, 'ffffffffffffff', '2025-01-20 23:33:25.035880', '2025-01-20 23:33:25.035880') RETURNING "id"
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save