blog/app/controllers/posts_controller.rb

INSERT INTO "posts" ("tittle", "description", "text", "created_at", "updated_at") VALUES ('Botafogo Campeão', 'Botafogo foi campeão da Libertadores e do Brasileirão', 'Botafogo em 2024 foi campeão da Copa Libertadores e do Campeonato Brasileiro.', '2025-01-20 21:47:00.164838', '2025-01-20 21:47:00.164838') RETURNING "id"
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "text" = 'Botafogo em 2024 foi campeão da Copa Libertadores e do Campeonato Brasileiro!', "updated_at" = '2025-01-20 21:47:23.939927' WHERE "posts"."id" = 1
---
  def update
    respond_to do |format|
      if @post.update(post_params)